{
    "title": "Elephants",
    "body":[
        {
            "type": "text",
            "content": "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant. Elephants are scattered throughout sub-Saharan Africa, South Asia, and Southeast Asia. Elephantidae is the only surviving family of the order Proboscidea; other, now extinct, families of the order include mammoths and mastodons. The largest living terrestrial animals."
        },
        {
            "type": "image",
            "link": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/African_Bush_Elephant.jpg/220px-African_Bush_Elephant.jpg",
            "caption": "African Bush Elephant"
        },
        {
            "type": "text",
            "content": "Elephants are herbivorous and can be found in different habitats including savannahs, forests, deserts, and marshes. They prefer to stay near water. They are considered to be keystone species due to their impact on their environments. Other animals tend to keep their distance from elephants while predators, such as lions, tigers, hyenas, and any wild dogs, usually target only young elephants (or \"calves\"). Elephants have a fission–fusion society in which multiple family groups come together to social"
        },
        {
            "type": "image",
            "link": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Loxodontacyclotis.jpg",
            "caption": "African forest elephant"
        },
        {
            "type": "text",
            "content": "Similar to the bush species, but with smaller and more rounded ears and thinner and straighter tusks."
        },
        {
            "type": "image",
            "link": "https://upload.wikimedia.org/wikipedia/commons/9/98/Elephas_maximus_%28Bandipur%29.jpg",
            "caption": "Asian Elephant"
        },
        {
            "type": "text",
            "content": "Has an arched back and only one finger-like process on the tip of the trunk. The Asian elephant has many features of the African bush elephant, including large ears, but smaller tusks, and a more rounded back."
        }
    ]
}